#+TITLE: Auditlogger Code, Deployment, and Reference Materials
#+TODO: TODO(t) IN-PROGRESS(i) WAITING(w) | DONE(d)
#+PROPERTY: header-args :comments none 
#+

** Build the container image
Build the container image:
#+BEGIN_SRC shell :async yes
  eval $(minikube -p minikube docker-env)
  TAG="$(date +%Y.%m.%d)"
  docker build -t raiinbow/auditlogger:"$TAG" app
#+END_SRC

#+RESULTS:
#+begin_example
Sending build context to Docker daemon  10.24kB
Step 1/10 : FROM node:12.14.1-alpine3.11
 ---> b0dc3a5e5e9e
Step 2/10 : RUN apk update && apk add vim postgresql-client netcat-openbsd
 ---> Using cache
 ---> 88b236f5ee71
Step 3/10 : RUN adduser -D -H -h /opt/apisnoop apisnoop
 ---> Using cache
 ---> 3beaabc8564a
Step 4/10 : WORKDIR /opt/apisnoop
 ---> Using cache
 ---> b678977c8e32
Step 5/10 : COPY auditlogger.js .
 ---> 4d85977cdfcd
Step 6/10 : COPY package.json .
 ---> 2f97d7f71b69
Step 7/10 : RUN npm i
 ---> Running in 891a76f6b7da
[91mnpm[0m[91m WARN deprecated[0m[91m urix@0.1.0: Please see https://github.com/lydell/urix#deprecated
[0m[91mnpm[0m[91m [0m[91mWARN[0m[91m [0m[91mdeprecated[0m[91m resolve-url@0.2.1: https://github.com/lydell/resolve-url#deprecated
[0m[91mnpm [0m[91mnotice created a lockfile as package-lock.json. You should commit this file.
[0m[91mnpm[0m[91m WARN[0m[91m apisnoop-auditlogger@0.0.2 No repository field.
[0m[91m
[0madded 227 packages from 171 contributors and audited 227 packages in 8.106s

1 package is looking for funding
  run `npm fund` for details

found 0 vulnerabilities

Removing intermediate container 891a76f6b7da
 ---> 5933290a61cc
Step 8/10 : EXPOSE 9900
 ---> Running in c029aea09dd8
Removing intermediate container c029aea09dd8
 ---> 1ebfa5c941f6
Step 9/10 : USER apisnoop
 ---> Running in e1098f1e9fde
Removing intermediate container e1098f1e9fde
 ---> a2e803e02073
Step 10/10 : CMD ["node", "auditlogger.js"]
 ---> Running in c882abdf7ea9
Removing intermediate container c882abdf7ea9
 ---> 7dcfaffdb13d
Successfully built 7dcfaffdb13d
Successfully tagged raiinbow/auditlogger:2020.08.19
#+end_example

Push the image:
#+BEGIN_SRC shell :async yes
  eval $(minikube -p minikube docker-env)
  TAG="$(date +%Y.%m.%d)"
  docker push raiinbow/auditlogger:"$TAG"
#+END_SRC

#+RESULTS:
#+begin_example
The push refers to repository [docker.io/raiinbow/auditlogger]
a055aa55ad02: Preparing
897e974b7299: Preparing
16906a9dc4d2: Preparing
53f117658a32: Preparing
3b9238999319: Preparing
1b3c39a9a303: Preparing
5280d2327565: Preparing
77d806cfa004: Preparing
930c8bc01816: Preparing
5216338b40a7: Preparing
1b3c39a9a303: Waiting
5280d2327565: Waiting
5216338b40a7: Waiting
77d806cfa004: Waiting
930c8bc01816: Waiting
3b9238999319: Layer already exists
53f117658a32: Layer already exists
5280d2327565: Layer already exists
1b3c39a9a303: Layer already exists
77d806cfa004: Layer already exists
930c8bc01816: Layer already exists
5216338b40a7: Layer already exists
16906a9dc4d2: Pushed
897e974b7299: Pushed
a055aa55ad02: Pushed
2020.08.19: digest: sha256:c01b7e5e35086e70f1a734d09fc7b4710ebbdc8c424aeaf6a7f057ca26a7ba7d size: 2411
#+end_example

